# Load Data from Database Using SQL

In [1]:
import pandas as pd

from sqlalchemy import create_engine

In [10]:
# Connect to sqlite db
db_file = 'gradedata.db'
engine = create_engine(r"sqlite:///{}".format(db_file))

In [9]:
#find out what tables are in the database
sql = "SELECT name FROM sqlite_master WHERE type = 'table';"

table_names = pd.read_sql(sql, engine)
table_names

   name
0  test

In [11]:
#get all the rows from the "test" table in the database
sql = "SELECT * FROM test;"
sales_data_df = pd.read_sql(sql, engine)
sales_data_df

   index    Names  Grades
0      0      Bob      76
1      1  Jessica      95
2      2     Mary      77
3      3     John      78
4      4      Mel      99

In [12]:
#query with conditional
sql = 'SELECT * FROM test WHERE Grades IN (76,77,78)'

grades_df = pd.read_sql(sql, engine)
grades_df

   index Names  Grades
0      0   Bob      76
1      2  Mary      77
2      3  John      78